order-load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 20
      rampTo: 30
      name: Spike phase
scenarios:
  - name: retrieve account and deposit
    flow:
      - post:
          url: '/orders'
          json:
            userId: 'asdf'
            lines: [{ productId: 'asdf1', quantity: 1 }, { productId: 'asdf2', quantity: 1 }]